Dlubal.RFEM5.Line
Line parameters

Dlubal.RFEM5.Line.No
Number

Dlubal.RFEM5.Line.ID
Identifier

Dlubal.RFEM5.Line.Comment
Comment

Dlubal.RFEM5.Line.Tag
Tag

Dlubal.RFEM5.Line.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.Line.IsGenerated
Information if the object is generated or not (read only)

Dlubal.RFEM5.Line.Type
Line type

Dlubal.RFEM5.Line.NodeCount
Number of nodes (read only)

Dlubal.RFEM5.Line.NodeList
List of nodes

Dlubal.RFEM5.Line.Length
Line length (read only)

Dlubal.RFEM5.Line.Rotation
Line rotation

Dlubal.RFEM5.Line.ControlPoints
Control points of the line (read only)